
a=int(input("Введите действительное число a: "))
b=int(input("Введите действительное число b: "))
c=int(input("Введите действительное число c: "))
if abs(a)>=4:
    print("Введённая вами переменная 'a': ", a )
else:
    print("Введенная вами переменная 'а' не соответствует условиям")
if abs(b)>=4:
    print("Введённая вами переменная 'b': ", b )
else:
    print("Введенная вами переменная 'b' не соответствует условиям")
if abs(c)>=4:
    print("Введённая вами переменная 'с': ", c )
else:
    print("Введенная вами переменная 'c' не соответствует условиям")